BaseConfiguration/Money_2_0/Catalogs/КартинкиПриложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КартинкиПриложения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкаBase64</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Системная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Теги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяСумма</Name>
					<Comment>Контрольная сумма объекта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>65</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментИзменения</Name>
					<Comment>Универсальное время последнего изменения объекта в миллисекундах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

BaseConfiguration/Money_2_0/Catalogs/КартинкиПриложения/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПроверитьНачальноеЗаполнение() Экспорт
	
	ЗаполнитьСистемныеКартинки();
	ЗаполнитьКартинкиКатегорий();
	
КонецПроцедуры

Процедура ЗаписатьКартинкуВРеквизитыСправочника(ОбъектСправочника, Картинка) Экспорт
	
	ОбъектСправочника.Картинка = Новый ХранилищеЗначения(Картинка, Новый СжатиеДанных(9));
	
	Если ТипЗнч(Картинка) = Тип("Картинка") Тогда
		ТекстКартинки = Base64Строка(Картинка.ПолучитьДвоичныеДанные());
		ТекстКартинки = СтрЗаменить(ТекстКартинки, Символы.ВК, "\" + Символы.ВК);
		
		ВремФормат = Картинка.Формат();
		ФорматСтрокой = НРег(?(ВремФормат = ФорматКартинки.НеизвестныйФормат, "svg", Строка(ВремФормат)));
		Если ФорматСтрокой = "svg" Тогда
			ФорматСтрокой = ФорматСтрокой + "+xml";
		КонецЕсли;
		
		ОбъектСправочника.КартинкаBase64 = СтрШаблон("url('data:image/%1;base64,%2')", 
					ФорматСтрокой, ТекстКартинки);
	Иначе
		ОбъектСправочника.КартинкаBase64 = "";
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТеги(ОбъектСправочника, ИмяЭлемента, НовыеТеги = Неопределено) Экспорт
	
	ОбъектСправочника.Теги = "";
	Если ОбъектСправочника.Системная Тогда
		Если СтрНайти(Нрег("Документация;ОписаниеИзменений;СлужбаПоддержки;Корзина;
			|ВКорзину;ИзКорзины;Настройки;Безопасность;РезервнаяКопияВосстановление;
			|РезервнаяКопияСоздание;Синхронизация"), нрег(ИмяЭлемента) + ";") > 0 Тогда
			ОбъектСправочника.Теги = "Сервис";
		Иначе
			ОбъектСправочника.Теги = "Разделы";
		КонецЕсли;
		
	КонецЕсли;
	
	Если НовыеТеги <> Неопределено Тогда
		ОбъектСправочника.Теги = ОбъектСправочника.Теги 
					+ ?(ОбъектСправочника.Теги = "", "", ";")
					+ НовыеТеги;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьСистемныеКартинки()
	
	Макет = ПолучитьМакет("Системные");
	Для каждого Область Из Макет.Области Цикл
		
		Если ТипЗнч(Область) <> Тип("РисунокТабличногоДокумента") Тогда
			Продолжить;
		КонецЕсли;
		
		ПроверитьЭлемент(Область.Имя, Область.Картинка, Истина);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьКартинкиКатегорий()
	
	СписокТегов = ОформлениеПриложенияКлиентСервер.СписокТеговДляКартинки(Истина);
	Макет = ПолучитьМакет("Категории");
	Для каждого Область Из Макет.Области Цикл
		
		Если ТипЗнч(Область) <> Тип("РисунокТабличногоДокумента") Тогда
			Продолжить;
		КонецЕсли;
		
		ПроверитьЭлемент(Область.Имя, Область.Картинка, Ложь, СписокТегов);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПроверитьЭлемент(ИмяЭлемента, Картинка, Системная, СписокТегов = Неопределено)
	
	ЧастиИмени = СтрРазделить(ИмяЭлемента, "_", Ложь);
	КодДляПоиска = СокрЛП(ЧастиИмени[0]);
	
	Ссылка = НайтиПоКоду(КодДляПоиска);
	Если ЗначениеЗаполнено(Ссылка) Тогда
		СпрОбъект = Ссылка.ПолучитьОбъект();
	Иначе
		СпрОбъект = СоздатьЭлемент();
	КонецЕсли;
	
	СпрОбъект.Код = КодДляПоиска;
	Если Не ЗначениеЗаполнено(СпрОбъект.Наименование) Тогда
		СпрОбъект.Наименование = КодДляПоиска;
	КонецЕсли;
	СпрОбъект.Системная = Системная;
	Если Системная Тогда
		СтрокаТегов = "";
	ИначеЕсли ЧастиИмени.Количество() > 1 И СписокТегов <> Неопределено Тогда
		СтрокаТегов = СтрокаТеговИзСтрокиНомеров(СписокТегов, ЧастиИмени[1]);
	КонецЕсли;
	
	ЗаписатьКартинкуВРеквизитыСправочника(СпрОбъект, Картинка);
	ЗаполнитьТеги(СпрОбъект, ИмяЭлемента, СтрокаТегов);
	
	СпрОбъект.ОбменДанными.Загрузка = Истина;
	СпрОбъект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов", Истина);
	СпрОбъект.Записать();
	Ссылка = СпрОбъект.Ссылка;
	
	Возврат Ссылка;
	
КонецФункции

Функция СтрокаТеговИзСтрокиНомеров(СписокТегов, Номера)
	
	Результат = "";
	ДлинаНомеров = СтрДлина(Номера);
	КоличествоТегов = СписокТегов.Количество();
	Для Счетчик = 1 По ДлинаНомеров Цикл
		
		Номер = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Сред(Номера, Счетчик, 1));
		Если Не ЗначениеЗаполнено(Номер)
				Или Номер > КоличествоТегов Тогда
			Продолжить;
		КонецЕсли;
		
		Результат = Результат 
					+ ?(Результат = "" Или Не ЗначениеЗаполнено(СписокТегов[Номер]), "", ";")
					+ СписокТегов[Номер];
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
